; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2687)
	(= (fuel plane1) 613)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city5)
	(= (capacity plane2) 10214)
	(= (fuel plane2) 703)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city4)
	(= (capacity plane3) 5824)
	(= (fuel plane3) 1549)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at person1 city4)
	(at person2 city0)
	(at person3 city6)
	(at person4 city1)
	(at person5 city1)
	(at person6 city6)
	(at person7 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 947)
	(= (distance city0 city2) 814)
	(= (distance city0 city3) 552)
	(= (distance city0 city4) 987)
	(= (distance city0 city5) 835)
	(= (distance city0 city6) 753)
	(= (distance city0 city7) 507)
	(= (distance city0 city8) 607)
	(= (distance city0 city9) 617)
	(= (distance city1 city0) 947)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 595)
	(= (distance city1 city3) 715)
	(= (distance city1 city4) 773)
	(= (distance city1 city5) 507)
	(= (distance city1 city6) 519)
	(= (distance city1 city7) 512)
	(= (distance city1 city8) 960)
	(= (distance city1 city9) 760)
	(= (distance city2 city0) 814)
	(= (distance city2 city1) 595)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 823)
	(= (distance city2 city4) 545)
	(= (distance city2 city5) 760)
	(= (distance city2 city6) 770)
	(= (distance city2 city7) 565)
	(= (distance city2 city8) 528)
	(= (distance city2 city9) 981)
	(= (distance city3 city0) 552)
	(= (distance city3 city1) 715)
	(= (distance city3 city2) 823)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 692)
	(= (distance city3 city5) 932)
	(= (distance city3 city6) 689)
	(= (distance city3 city7) 830)
	(= (distance city3 city8) 753)
	(= (distance city3 city9) 780)
	(= (distance city4 city0) 987)
	(= (distance city4 city1) 773)
	(= (distance city4 city2) 545)
	(= (distance city4 city3) 692)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 832)
	(= (distance city4 city6) 700)
	(= (distance city4 city7) 595)
	(= (distance city4 city8) 884)
	(= (distance city4 city9) 688)
	(= (distance city5 city0) 835)
	(= (distance city5 city1) 507)
	(= (distance city5 city2) 760)
	(= (distance city5 city3) 932)
	(= (distance city5 city4) 832)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 930)
	(= (distance city5 city7) 638)
	(= (distance city5 city8) 696)
	(= (distance city5 city9) 538)
	(= (distance city6 city0) 753)
	(= (distance city6 city1) 519)
	(= (distance city6 city2) 770)
	(= (distance city6 city3) 689)
	(= (distance city6 city4) 700)
	(= (distance city6 city5) 930)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 755)
	(= (distance city6 city8) 792)
	(= (distance city6 city9) 753)
	(= (distance city7 city0) 507)
	(= (distance city7 city1) 512)
	(= (distance city7 city2) 565)
	(= (distance city7 city3) 830)
	(= (distance city7 city4) 595)
	(= (distance city7 city5) 638)
	(= (distance city7 city6) 755)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 529)
	(= (distance city7 city9) 799)
	(= (distance city8 city0) 607)
	(= (distance city8 city1) 960)
	(= (distance city8 city2) 528)
	(= (distance city8 city3) 753)
	(= (distance city8 city4) 884)
	(= (distance city8 city5) 696)
	(= (distance city8 city6) 792)
	(= (distance city8 city7) 529)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 772)
	(= (distance city9 city0) 617)
	(= (distance city9 city1) 760)
	(= (distance city9 city2) 981)
	(= (distance city9 city3) 780)
	(= (distance city9 city4) 688)
	(= (distance city9 city5) 538)
	(= (distance city9 city6) 753)
	(= (distance city9 city7) 799)
	(= (distance city9 city8) 772)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city1)
	(at person1 city8)
	(at person2 city1)
	(at person3 city3)
	(at person4 city0)
	(at person5 city1)
	(at person6 city5)
	(at person7 city7)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 613 to 2687
   goals met: 1 of 8
2. (fly plane3 city4 city1)
   deleted: (at plane3 city4)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 0 to 1546, (fuel plane3) from 1549 to 3
   goals met: 2 of 8
3. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 8
4. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1546 to 2493, (fuel plane1) from 2687 to 1740
   goals met: 2 of 8
5. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
6. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
7. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2493 to 3266, (fuel plane1) from 1740 to 967
   goals met: 3 of 8
8. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 8
9. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 8
10. (fly plane1 city4 city8)
   deleted: (at plane1 city4)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 3266 to 4150, (fuel plane1) from 967 to 83
   goals met: 3 of 8
11. (debark person1 plane1 city8)
   deleted: (in person1 plane1)
   added: (at person1 city8)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 8
12. (refuel plane1 city8)
   changed: (fuel plane1) from 83 to 2687
   goals met: 4 of 8
13. (fly plane1 city8 city0)
   deleted: (at plane1 city8)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4150 to 4757, (fuel plane1) from 2687 to 2080
   goals met: 4 of 8
14. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
15. (fly plane1 city0 city7)
   deleted: (at plane1 city0)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 4757 to 5264, (fuel plane1) from 2080 to 1573
   goals met: 5 of 8
16. (debark person7 plane1 city7)
   deleted: (in person7 plane1)
   added: (at person7 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
17. (fly plane1 city7 city6)
   deleted: (at plane1 city7)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 5264 to 6019, (fuel plane1) from 1573 to 818
   goals met: 6 of 8
18. (board person3 plane1 city6)
   deleted: (at person3 city6)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 8
19. (board person6 plane1 city6)
   deleted: (at person6 city6)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 8
20. (fly plane1 city6 city3)
   deleted: (at plane1 city6)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 6019 to 6708, (fuel plane1) from 818 to 129
   goals met: 6 of 8
21. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 8
22. (refuel plane1 city3)
   changed: (fuel plane1) from 129 to 2687
   goals met: 7 of 8
23. (fly plane1 city3 city5)
   deleted: (at plane1 city3)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 6708 to 7640, (fuel plane1) from 2687 to 1755
   goals met: 7 of 8
24. (debark person6 plane1 city5)
   deleted: (in person6 plane1)
   added: (at person6 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
